<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"7bcbf59dee620aca7936dd3f80fdc2f7f0a285964eaef54c33b67ec1223df4cc","plan_job_ref":"Job API #1590 at https://github.com/coverage-robot/core/actions/runs/8427188750","plan_out_hash":"aeb444ab0a54b53e6b1035c448cec96c73fc2c2da41ef95dd00bacf31a1068bf","plan_hash":"637fdf121f73b091c00f6edeb2d94d0dc10afc07eebec7dd76004da643aa057d","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./services/api/infrastructure__ in the __prod__ workspace
With var files: `./services/api/infrastructure/prod.tfvars`
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.api.aws_cognito_user_pool_client.cognito_client will be created
+   resource "aws_cognito_user_pool_client" "cognito_client" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = (known after apply)
+       allowed_oauth_flows_user_pool_client          = (known after apply)
+       allowed_oauth_scopes                          = (known after apply)
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = (known after apply)
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_ADMIN_USER_PASSWORD_AUTH",
+           "ALLOW_REFRESH_TOKEN_AUTH",
        ]
+       generate_secret                               = true
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = (known after apply)
+       name                                          = "coverage-api-prod"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = (known after apply)
+       user_pool_id                                  = "*******************"
+       write_attributes                              = (known after apply)
    }

  # module.api.aws_lambda_function.api will be updated in-place
!~  resource "aws_lambda_function" "api" {
        id                             = "coverage-api-prod"
!~      last_modified                  = "2024-03-18T02:00:04.000+0000" -> (known after apply)
!~      source_code_hash               = "0E8FhTieCW/Rrd0iFxGiw4Jg5zG85TLb06kET18nmoI=" -> "Uoqmd3F3cinncdpl53Q1OAnakqLXjH2IvT9QLlHgl8w="
        tags                           = {}
#        (20 unchanged attributes hidden)

!~      environment {
!~          variables = {
-               "AWS_ACCOUNT_ID"    = "************"
-               "BREF_PING_DISABLE" = "1"
            } -> (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # module.event_listener.aws_lambda_function.events will be updated in-place
!~  resource "aws_lambda_function" "events" {
        id                             = "coverage-api-event-listener-prod"
!~      last_modified                  = "2024-03-18T01:59:37.000+0000" -> (known after apply)
!~      source_code_hash               = "0E8FhTieCW/Rrd0iFxGiw4Jg5zG85TLb06kET18nmoI=" -> "Uoqmd3F3cinncdpl53Q1OAnakqLXjH2IvT9QLlHgl8w="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.webhook_handler.aws_lambda_function.webhooks will be updated in-place
!~  resource "aws_lambda_function" "webhooks" {
        id                             = "coverage-api-webhook-handler-prod"
!~      last_modified                  = "2024-03-18T01:59:50.000+0000" -> (known after apply)
!~      source_code_hash               = "0E8FhTieCW/Rrd0iFxGiw4Jg5zG85TLb06kET18nmoI=" -> "Uoqmd3F3cinncdpl53Q1OAnakqLXjH2IvT9QLlHgl8w="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [API #1590](https://github.com/coverage-robot/core/actions/runs/8427188750)